# Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно.
for i in range(10, 21):
    print(i ** 2, end=', ')


